app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.all.find(params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "English"], ["room_number", 101], ["created_at", "2020-08-09 02:06:10.257682"], ["updated_at", "2020-08-09 02:06:10.257682"]]
---
    def create
        @school_class = SchoolClass.create(post_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "French"], ["room_number", 505], ["updated_at", "2020-08-09 02:11:45.952865"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class = SchoolClass.update(post_params(:title, :room_number))